import { About } from "../types/about"

export default {
   description: `
    أنا مطوّر برمجيات عملي أركز على بناء أنظمة منطقية، قابلة للتوسّع، وموجهة لتلبية احتياجات المستخدمين. أُولي اهتمامًا كبيرًا بهندسة الأنظمة إلى جانب تنفيذها، وأتعامل مع المشكلات من خلال تحليلها، والتشكيك في الفرضيات، والسعي نحو حلول واضحة ومستدامة.
    <br />
    أعمل بكفاءة في البيئات السريعة التي تتطلب تحمل المسؤولية. سواء كنت جزءًا من فريق أو أعمل بشكل مستقل، أركّز دائمًا على ما يجب إنجازه ولماذا. أعتمد على المنطق، واتخاذ قرارات مدروسة، والتطوير المستمر.
    <br />
    لا أحصر نفسي في دور واحد. أمتلك القدرة على التكيّف، أتعلم بسرعة، وأبقى موجّهًا نحو النتائج من الفكرة الأولى وحتى التسليم النهائي.`,

   profileViews: "عدد مشاهدات الملف الشخصي",
   technologies: "التقنيات التي عملت بها",
   title: "مرحبًا 👋، أنا يحيى الجويني",
   websiteDescription:
      "هذا الموقع مستوحى من تصميم GitHub. لا تتردد في تصفّح مشاريعي. وإذا كانت لديك أي أسئلة أو رغبت في التواصل، يسعدني ذلك!",
} satisfies About
