import { About } from "../types"

export default {
   description: `
  <p>أنا شخص أستمتع فعلًا بعلوم الحاسوب وتطوير البرمجيات، خاصة من الجهة التقنية. يعجبني أن أفهم كيف تعمل الأنظمة من الداخل، كيف يكون الكود منظّمًا، ولماذا تكون بعض القرارات في التصميم أفضل من غيرها.</p>
  <p>أكثر شيء أحبه هو تفكيك المشاكل، والتفكير في المنطق بهدوء، وبناء الأشياء بطريقة واضحة ومتماسكة. أنا أميل أكثر إلى البرمجة منخفضة المستوى وبرمجة الأنظمة، إلى جانب تطوير الـ backend والـ architecture والبرمجيات المبنية على أسس تقنية قوية.</p>
  <p>أنا لا أرى البرمجة مجرد جعل الأشياء تعمل فقط. الجزء الذي يهمني فعلًا هو أن أفهمها بشكل صحيح، وأن أحسنها، وأن أتعلم أكثر مع كل مشروع أعمل عليه.</p>`,
   technologies: "التقنيات التي عملت بها",
   title: "مرحبًا 👋، أنا يحيى الجويني",
   websiteDescription: " مستوحى من تصميم GitHub",
} satisfies About
